tap "facebook/fb"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "xcodesorg/made"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Identify unused code in Swift projects
brew "periphery"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Install and switch between multiple versions of Xcode
brew "xcodesorg/made/xcodes"
# Tools for building Android applications
cask "android-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Web debugging Proxy application
cask "charles"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Tool to run Windows software
cask "crossover"
# Server and cloud storage browser
cask "cyberduck"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# System-wide audio equaliser
cask "eqmac"
# Collaborative team software
cask "figma"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Xcode extension for GitHub Copilot
cask "github-copilot-for-xcode"
# Web browser
cask "google-chrome@dev"
# Open-source video transcoder
cask "handbrake-app"
# Tool to optimise images to a smaller size
cask "imageoptim"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Project management software
cask "lark"
# Software for Logitech devices
cask "logi-options+"
# Clipboard manager
cask "maccy"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
mas "Flow", id: 1423210932
mas "WireGuard", id: 1451685025
vscode "42crunch.vscode-openapi"
vscode "ahinkle.laravel-model-snippets"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alperenersoy.filament-snippets"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "amirmarmul.laravel-blade-vscode"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "austenc.laravel-blade-spacer"
vscode "austenc.laravel-docs"
vscode "austenc.tailwind-docs"
vscode "azemoh.one-monokai"
vscode "batisteo.vscode-django"
vscode "blaugold.melos-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cierra.livewire-vscode"
vscode "cjhowe7.laravel-blade"
vscode "codingyu.laravel-goto-view"
vscode "ctf0.laravel-goto-controller"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "diemasmichiels.emulate"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "felixangelov.bloc"
vscode "file-icons.file-icons"
vscode "flutterbricksproductions.flutterbricks"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "gaetschwartz.build-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "heybourn.headwind"
vscode "hirantha.json-to-dart"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hzgood.dart-data-class-generator"
vscode "icrawl.discord-vscode"
vscode "ihsanis.scrcpy"
vscode "ihunte.laravel-blade-wrapper"
vscode "infeng.vscode-react-typescript"
vscode "innwin.i18n-arb-editor"
vscode "jasonnutter.search-node-modules"
vscode "jeroen-meijer.pubspec-assist"
vscode "jock.svg"
vscode "johnpapa.vscode-cloak"
vscode "juniorpeixoto.vscode-filamentphp-helpers"
vscode "kevinrose.vsc-python-indent"
vscode "kiritchoukc.flutter-clean-architecture"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "liamhammett.inline-parameters"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "localizely.flutter-intl"
vscode "loyieking.smalise"
vscode "mathiasfrohlich.kotlin"
vscode "mehedidracula.php-namespace-resolver"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mohamedbenhida.laravel-intellisense"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrworkman.papercolor-vscode-redux"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naco-siren.gradle-language"
vscode "naoray.laravel-goto-components"
vscode "nash.awesome-flutter-snippets"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "nhoizey.gremlins"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "oven.bun-vscode"
vscode "paragdiwan.gitpatch"
vscode "patbenatar.advanced-new-file"
vscode "paulshen.paul-typescript-toolkit"
vscode "pflannery.vscode-versionlens"
vscode "pgl.laravel-jump-controller"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryannaddy.laravel-artisan"
vscode "ryu1kn.partial-diff"
vscode "selcuk-usta.code-complexity-report-generator"
vscode "shufo.vscode-blade-formatter"
vscode "sleistner.vscode-fileutils"
vscode "stylelint.vscode-stylelint"
vscode "surendrajat.apklab"
vscode "sweetpad.sweetpad"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "wongjn.php-sniffer"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zobo.php-intellisense"
vscode "zxh404.vscode-proto3"
