tap "cameroncooke/axe", trusted: true
tap "getsentry/xcodebuildmcp", trusted: true
tap "gromgit/fuse", trusted: true
tap "jesseduffield/lazygit", trusted: true
tap "xcodesorg/made", trusted: true
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Download with resuming and segmented downloading
brew "aria2"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Code searching, linting, rewriting
brew "ast-grep"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Full-featured MP4 format and MPEG DASH library and tools
brew "bento4"
# Parser generator
brew "bison"
# Freely available high-quality data compressor
brew "bzip2"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# Wrap Gemini CLI, Codex, Claude Code, Qwen Code as an API service
brew "cliproxyapi"
# Cross-platform make
brew "cmake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Image format providing lossless and lossy compression for web images
brew "webp"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@78"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Portable Foreign Function Interface library
brew "libffi"
# Firebase command-line tools
brew "firebase-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Network authentication protocol
brew "krb5"
# Simple terminal UI for git commands
brew "lazygit"
# BSD-style licensed readline alternative
brew "libedit"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# NaCl networking and cryptography library
brew "libsodium"
# GNOME XML library
brew "libxml2"
# YAML Parser
brew "libyaml"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Language Server for the Lua language
brew "lua-language-server"
# Utility for directing compilation
brew "make"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# ISO-C API and CLI for generating UUIDs
brew "ossp-uuid"
# Identify unused code in Swift projects
brew "periphery"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generate C-based recognizers from regular expressions
brew "re2c"
# SVG rendering tool and library
brew "resvg"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Create beautiful image of your source code
brew "silicon"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# TOML toolkit written in Rust
brew "taplo"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Little beautifier tool for xcodebuild
brew "xcbeautify"
# Build server protocol implementation for integrating Xcode with sourcekit-lsp
brew "xcode-build-server"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI tool for interacting with iOS Simulators via accessibility and HID APIs
brew "cameroncooke/axe/axe", trusted: true
# Model Context Protocol server for Xcode project workflows
brew "getsentry/xcodebuildmcp/xcodebuildmcp", trusted: true
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac", trusted: true
# Tools for building Android applications
cask "android-studio"
# Web debugging Proxy application
cask "charles@4"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Tool to run Windows software
cask "crossover"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# System-wide audio equaliser
cask "eqmac"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Tool to optimise images to a smaller size
cask "imageoptim"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# GPU-based terminal emulator
cask "kitty"
# Project management software
cask "lark"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Software for Logitech devices
cask "logi-options+"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Open-source software for live streaming and screen recording
cask "obs"
# AI usage tracker for Cursor, Claude Code, Codex, Copilot and more
cask "openusage"
# Replacement for Docker Desktop
cask "orbstack"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Native database client for many database types
cask "tablepro"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtual machines UI using QEMU
cask "utm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Flow", id: 1423210932
mas "Grammarly for Safari", id: 1462114288
mas "Sel", id: 6780409611
mas "uBlock Origin Lite", id: 6745342698
mas "WireGuard", id: 1451685025
uv "pre-commit"
uv "serena-agent"
uv "uv-plugin-up"
npm "@dokploy/cli"
npm "@fission-ai/openspec"
npm "@marp-team/marp-cli"
npm "agent-browser"
