# Tap
tap 'jesseduffield/lazygit'
tap 'leoafarias/fvm'
tap 'oven-sh/bun'

# CLI Tools
brew 'cmake'
brew 'coreutils'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fvm'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'gnu-sed'
brew 'grep'
brew 'imagemagick'
brew 'jq'
brew 'lazygit'
brew 'mas'
brew 'make'
brew 'moreutils'
brew 'neofetch'
brew 'neovim'
brew 'openssh'
brew 'openssl'
brew 'poppler'
brew 'pinentry-mac'
brew 'resvg'
brew 'ripgrep'
brew 'sevenzip'
brew 'stow'
brew 'tlrc'
brew 'thefuck'
brew 'tmux'
brew 'yazi'
brew 'yt-dlp'
brew 'zoxide'
brew 'zsh'

# Dev Tools
brew 'go'
brew 'uv'
brew 'php'
brew 'composer'
brew 'bun'

# Applications
cask 'android-studio'
cask 'brave-browser'
cask 'cloudflare-warp'
cask 'cursor'
cask 'dbeaver-community'
cask 'discord'
cask 'docker'
cask 'eqmac'
cask 'figma'
cask 'ghostty'
cask 'handbrake'
cask 'imageoptim'
cask 'keka'
cask 'logi-options+'
cask 'maccy'
cask 'microsoft-office'
cask 'notion'
cask 'obs'
cask 'postman'
cask 'raycast'
cask 'shottr'
cask 'signal'
cask 'telegram'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quick Look

cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-jetbrains-mono-nerd-font'

# App Store
mas 'Xcode', id:497799835
